IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9(7) VALUE '1'.
01 B PIC 9(7) VALUE '0'.

PROCEDURE DIVISION.
    DISPLAY 0000000,
    DISPLAY 0000001,
    DISPLAY "000000"A,
    DIVIDE 1000000 INTO A,
    ADD A TO A GIVING B,
    DISPLAY B,
    ADD B TO A,
    DISPLAY A.
    SOMELOOP.
        ADD A TO B,
        ADD B TO A,
        DISPLAY B,
        DISPLAY A.
    IF A < 1000000 THEN PERFORM SOMELOOP END-IF.
    ADD A TO B,
        ADD B TO A,
        DISPLAY B,
        DISPLAY A.
STOP RUN.
